OpenNuvoton/M031BSP/SampleCode/StdDriver/USBD_Mass_Storage_CDROM/MassStorage.c
/******************************************************************************
 * @file     MassStorage.c
 * @version  V1.00
 * $Revision: 13 $
 * $Date: 18/07/23 11:02a $
 * @brief    M031 series USBD driver Sample file
 *
 * @note
 * SPDX-License-Identifier: Apache-2.0
 * Copyright (C) 2018 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
/*!<Includes */
#include <string.h>
#include "NuMicro.h"
#include "massstorage.h"

/*--------------------------------------------------------------------------*/
/* Global variables for Control Pipe */
int32_t g_TotalSectors = 0;

uint8_t volatile g_u8EP2Ready = 0;
uint8_t volatile g_u8EP3Ready = 0;
uint8_t volatile g_u8Remove = 0;
uint8_t volatile g_u8Suspend = 0;

/* USB flow control variables */
uint8_t g_u8BulkState;
uint8_t g_u8Prevent = 0;
uint8_t g_u8Size;

uint8_t g_au8SenseKey[4];

uint32_t g_u32DataFlashStartAddr;
uint32_t g_u32Address;
uint32_t g_u32Length;
uint32_t g_u32LbaAddress;
uint32_t g_u32BytesInStorageBuf;

uint32_t g_u32BulkBuf0, g_u32BulkBuf1;

/* CBW/CSW variables */
struct CBW g_sCBW;
struct CSW g_sCSW;

uint32_t MassBlock[MASS_BUFFER_SIZE / 4];
uint32_t Storage_Block[STORAGE_BUFFER_SIZE / 4];

/*--------------------------------------------------------------------------*/
uint8_t g_au8InquiryID[36] =
{
    0x05,                   /* Peripheral Device Type : CD/DVD */
    0x80,                   /* RMB */
    0x00,                   /* ISO/ECMA, ANSI Version */
    0x32,                   /* Response Data Format */
    0x1F, 0x00, 0x00, 0x00, /* Additional Length */

    /* Vendor Identification */
    'N', 'u', 'v', 'o', 't', 'o', 'n', ' ',

    /* Product Identification */
    'U', 'S', 'B', ' ', 'C', 'D', 'R', 'O', 'M', ' ', ' ', ' ', ' ',

    /* Product Revision */
    '1', '.', '0', '0'
};

/* code = 5Ah, Mode Sense 10 */
static uint8_t g_au8ModePage_01[12] =
{
    0x01, 0x0A, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00,
    0x03, 0x00, 0x00, 0x00
};

static uint8_t g_au8ModePage_05[32] =
{
    0x05, 0x1E, 0x13, 0x88, 0x08, 0x20, 0x02, 0x00,
    0x01, 0xF4, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x05, 0x1E, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x01, 0x68, 0x00, 0x00
};

static uint8_t g_au8ModePage_1B[12] =
{
    0x1B, 0x0A, 0x00, 0x01, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00
};

static uint8_t g_au8ModePage_1C[8] =
{
    0x1C, 0x06, 0x00, 0x05, 0x00, 0x00, 0x00, 0x00
};

static uint8_t  g_au8ReadTOC_LBA0[] =
{
    /* TOC response header */
    0x00, 0x12,
    0x01,
    0x01,
    /* track descriptor 1 */
    0x00,
    0x14,
    0x01,
    0x00,
    0x00, 0x00, 0x00, 0x00,
    /* track descriptor 2 */
    0x00,
    0x14,
    0xAA,
    0x00,
    0x00, 0x00, 0x08, 0x00
};

static uint8_t g_au8ReadTOC_LBA1[] =
{
    /* TOC response header */
    0x00, 0x0A,
    0x01,
    0x01,
    /* track descriptor */
    0x00,
    0x14,
    0x01,
    0x00,
    0x00, 0x00, 0x00, 0x00
};

static uint8_t g_au8ReadTOC_MSF0[] =
{
    /* TOC response header */
    0x00, 0x12,
    0x01,
    0x01,
    /* track descriptor 1 */
    0x00,
    0x14,
    0x01,
    0x00,
    0x00, 0x00, 0x02, 0x00,
    /* track descriptor 2 */
    0x00,
    0x14,
    0xAA,
    0x00,
    0x00, 0x00, 0x29, 0x23
};

static uint8_t g_au8ReadTOC_MSF2[] =
{
    /* TOC response header */
    0x00, 0x2E,             /* Data Length */
    0x01,                   /* First Track */
    0x01,                   /* Last Track */
    /* track descriptors */
    /* Session ADR/CTRL  TNO   POINT  Min Sec Frame  ZERO PMIN PSEC PFRAME */
    0x01,    0x14,   0x00, 0xA0, 0x00,0x00,0x00, 0x00,0x01,0x00,0x00,
    0x01,    0x14,   0x00, 0xA1, 0x00,0x00,0x00, 0x00,0x01,0x00,0x00,
    0x01,    0x14,   0x00, 0xA2, 0x00,0x00,0x00, 0x00,0x00,0x1d,0x17,
    0x01,    0x14,   0x00, 0x01, 0x00,0x00,0x00, 0x00,0x01,0x02,0x00
};

const uint8_t g_au8GetConfiguration[] =
{
    /* Feature Header */
    0x00, 0x00, 0x00, 0x4C, /* Data Length */
    0x00, 0x00,             /* Reserved */
    0x00, 0x00,             /* Current Profile */
    /* Profile List */
    0x00, 0x00,             /* Feature Code (0000h = Profile List) */
    0x03,                   /* Version(0) /Persistent(1) /Current(1) */
    0x04,                   /* Additional Length (= number of profile descriptor x 4) */
    /* Profile Descriptor */
    0x00, 0x08,             /* Profile Number (CD-ROM) */
    0x00,                   /* CurrentP */
    0x00,                   /* Reserved */
    /* Features */
    0x00, 0x01,             /* Core Feature */
    0x0B,                   /* Version(2) /Persistent(1) /Current(1) */
    0x08,                   /* Additional Length */
    0x00, 0x00, 0x00, 0x02, /* Physical Interface Standard (0x00000002: ATAPI) */
    0x01,                   /* INQ2(0) / Device Busy Event(1) */
    0x00, 0x00, 0x00,       /* Reserved */

    0x00, 0x02,             /* Morphing Feature */
    0x07,                   /* Version(2) /Persistent(1) /Current(1) */
    0x04,                   /* Additional Length */
    0x02,                   /* OCEvent(1) / ASYNC(0) */
    0x00, 0x00, 0x00,       /* Reserved */

    0x00, 0x03,             /* Removable Medium Feature */
    0x0B,                   /* Version(0) /Persistent(1) /Current(1) */
    0x04,                   /* Additional Length */
    0x29,                   /* Loading mechanism (Tray:001h) /Eject(1) / Pvnt Jmpr(0) / Lock(1) */
    0x00, 0x00, 0x00,       /* Reserved */

    0x00, 0x10,             /* Random Readable Feature */
    0x00,                   /* Version(0) /Persistent(0) /Current(0) */
    0x08,                   /* Additional Length */
    0x00, 0x00, 0x08, 0x00, /* Logical Block Size */
    0x00, 0x01,             /* Blocking */
    0x00,                   /* Page Present */
    0x00,                   /* Reserved */

    0x00, 0x1E,             /* CD Read Feature */
    0x08,                   /* Version(2) /Persistent(0) /Current(0) */
    0x04,                   /* Additional Length */
    0x00,                   /* DAP(0) / C2 Flags(0) / CD-Text(0) */
    0x00, 0x00, 0x00,       /* Reserved */

    0x01, 0x00,             /* Power Management Feature */
    0x03,                   /* Version(0) /Persistent(1) /Current(1) */
    0x00,                   /* Additional Length */

