OpenNuvoton/M031BSP/SampleCode/StdDriver/USBD_Mass_Storage_CDROM/MassStorage.c
void MSC_ReadTOC(void)
{
    uint32_t u32Len;
    uint8_t u8format = (g_sCBW.u8LUN & 0x0F) | (g_sCBW.au8Data[7] >> 6);

    if (g_sCBW.u8LUN == 0x02)
    {
        switch (u8format)
        {
            case 0x00:
            {
                u32Len = g_sCBW.dCBWDataTransferLength;
                if (u32Len > sizeof(g_au8ReadTOC_MSF0))
                    u32Len = sizeof(g_au8ReadTOC_MSF0);
                g_u8BulkState = BULK_IN;
                USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8ReadTOC_MSF0, u32Len);
                USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                break;
            }
            case 0x02:
            {
                u32Len = g_sCBW.dCBWDataTransferLength;
                if (u32Len > sizeof(g_au8ReadTOC_MSF2))
                    u32Len = sizeof(g_au8ReadTOC_MSF2);
                g_u8BulkState = BULK_IN;
                USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8ReadTOC_MSF2, u32Len);
                USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                break;
            }
            default:
                g_au8SenseKey[0] = 0x05;
                g_au8SenseKey[1] = 0x24;
                g_au8SenseKey[2] = 0x00;
        }
    }
    else if (g_sCBW.u8LUN == 0x00)
    {
        switch (g_sCBW.au8Data[0])
        {
            case 0x01:
            {
                u32Len = g_sCBW.dCBWDataTransferLength;
                if (u32Len > sizeof(g_au8ReadTOC_LBA1))
                    u32Len = sizeof(g_au8ReadTOC_LBA1);
                g_u8BulkState = BULK_IN;
                USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8ReadTOC_LBA1, u32Len);
                USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                break;
            }
            case 0x00:
            {
                u32Len = g_sCBW.dCBWDataTransferLength;
                if (u32Len > sizeof(g_au8ReadTOC_LBA0))
                    u32Len = sizeof(g_au8ReadTOC_LBA0);
                g_u8BulkState = BULK_IN;
                USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8ReadTOC_LBA0, u32Len);
                USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                break;
            }
            default:
                g_au8SenseKey[0] = 0x05;
                g_au8SenseKey[1] = 0x24;
                g_au8SenseKey[2] = 0x00;
                break;
        }
    }
    else
    {
        g_au8SenseKey[0] = 0x05;
        g_au8SenseKey[1] = 0x24;
        g_au8SenseKey[2] = 0x00;

        USBD_SET_EP_STALL(EP2);
        g_u8Prevent = 1;
        g_sCSW.bCSWStatus = 0x01;
        g_sCSW.dCSWDataResidue = 0;
        g_u8BulkState = BULK_IN;
        MSC_AckCmd();
        return;
    }
}

void MSC_GetConfiguration(uint32_t len, uint8_t *buff)
{
    uint32_t u32index, u32feature_len;
    uint8_t  *ptr;

    if (g_u8Remove)
    {
        memset((int8_t *)buff, 0, len);
        return;
    }

    if (g_sCBW.u8LUN == 0x02)
    {
        memcpy( buff, g_au8GetConfiguration, 8);
        u32feature_len = 0;
        /* the first feature on the array */
        u32index = 8;

        /* find the specified feature */
        while ( u32index < sizeof(g_au8GetConfiguration) - u32index)
        {
            if ((g_au8GetConfiguration[u32index] == g_sCBW.au8Data[0]) && (g_au8GetConfiguration[u32index + 1] == g_sCBW.au8Data[1]))
            {
                /* copy the feature */
                u32feature_len = g_au8GetConfiguration[u32index + 3] + 4;
                memcpy(buff + 8, &g_au8GetConfiguration[u32index], u32feature_len);
                break;
            }
            else
            {
                u32index += (g_au8GetConfiguration[u32index + 3] + 4);
            }
        }
        /* fix up return length */
        len = 8 + u32feature_len;
        buff[3] = len - 4;
    }
    else if (g_sCBW.u8LUN == 0x01)
    {
        memcpy(buff, g_au8GetConfiguration, 8);
        ptr = buff + 8;

        /* the first feature on the array */
        u32index = 8;

        /* find current features */
        while ( u32index < sizeof(g_au8GetConfiguration) - u32index)
        {
            u32feature_len = g_au8GetConfiguration[u32index + 3] + 4;
            if (g_au8GetConfiguration[u32index + 2] & 0x01)    /* check current bit */
            {
                memcpy( ptr, &g_au8GetConfiguration[u32index], u32feature_len);
                ptr += u32feature_len;
            }
            u32index += u32feature_len;
        }
        len = ptr - buff;
        buff[3] = len - 4;
    }
    else if (g_sCBW.u8LUN == 0x00)
        memcpy((char *)buff, &g_au8GetConfiguration[0], sizeof(g_au8GetConfiguration));
    else
    {
        g_au8SenseKey[0] = 0x05;
        g_au8SenseKey[1] = 0x24;
        g_au8SenseKey[2] = 0x00;
    }
}

void MSC_GetEventStatusNotification(void)
{
    uint32_t u32Len;

    u32Len = g_sCBW.dCBWDataTransferLength;
    if (u32Len > 8)
        u32Len = 8;

    g_u8BulkState = BULK_IN;
    USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8GetEventStatusNotification_01, u32Len);
    /* Trigger to send out the data packet */
    USBD_SET_PAYLOAD_LEN(EP2, u32Len);
}

void MSC_RequestSense(void)
{
    uint8_t tmp[20];

    memset(tmp, 0, 18);
    if (g_u8Prevent)
    {
        g_u8Prevent = 0;
        tmp[0]= 0x70;
    }
    else
        tmp[0] = 0xf0;

    tmp[2] = g_au8SenseKey[0];
    tmp[7] = 0x0a;
    tmp[12] = g_au8SenseKey[1];
    tmp[13] = g_au8SenseKey[2];
    USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), tmp, 20);

    g_au8SenseKey[0] = 0;
    g_au8SenseKey[1] = 0;
    g_au8SenseKey[2] = 0;
}

void MSC_ReadFormatCapacity(void)
{
    memset((uint8_t *)MassCMD_BUF, 0, 12);

    *((uint8_t *)(MassCMD_BUF+0)) = 0x00;
    *((uint8_t *)(MassCMD_BUF+1)) = 0x00;
    *((uint8_t *)(MassCMD_BUF+2)) = 0x00;
    *((uint8_t *)(MassCMD_BUF+3)) = 0x08;                      /* Capacity List Length */

    /* Block Count */
    *((uint8_t *)(MassCMD_BUF+4)) = (g_TotalSectors >> 24) & 0xFF;
    *((uint8_t *)(MassCMD_BUF+5)) = (g_TotalSectors >> 16) & 0xFF;
    *((uint8_t *)(MassCMD_BUF+6)) = (g_TotalSectors >>  8) & 0xFF;
    *((uint8_t *)(MassCMD_BUF+7)) = (g_TotalSectors >>  0) & 0xFF;

